Repository: konecnyjakub/Empire_Builder
Catalog: translations/wesnoth-Empire_Builder/*.po
Languages: cs

source: $player_recruits[$side_number].hero32.name ($player_recruits[$side_number].hero32.gold_cost gold, $player_recruits[$side_number].hero32.food_cost food)
cs: &$player_recruits[$side_number].hero32.image|=$player_recruits[$side_number].hero32.name ($player_recruits[$side_number].hero32.gold_cost zlata, $player_recruits[$side_number].hero32.food_cost jídla)

source: $player_recruits[$side_number].hero41.name ($player_recruits[$side_number].hero41.gold_cost gold, $player_recruits[$side_number].hero41.food_cost food)
cs: &$player_recruits[$side_number].hero41.image|=$player_recruits[$side_number].hero41.name ($player_recruits[$side_number].hero41.gold_cost zlata, $player_recruits[$side_number].hero41.food_cost jídla)

source: $player_recruits[$side_number].hero42.name ($player_recruits[$side_number].hero42.gold_cost gold, $player_recruits[$side_number].hero42.food_cost food)
cs: &$player_recruits[$side_number].hero42.image|=$player_recruits[$side_number].hero42.name ($player_recruits[$side_number].hero42.gold_cost zlata, $player_recruits[$side_number].hero42.food_cost jídla)

source: Transaction completed.
cs: Transakce dokončena.

source: What do you want exchange?
cs: Co chcete vyměnit?

source: Nothing
cs: Nic

source: 15 gold for 10 food
cs: 15 zlata za 10 jídla

source: 15 gold for 10 wood
cs: 15 zlata za 10 dřeva

source: 15 gold for 10 ore
cs: 15 zlata za 10 rud

source: 10 food for 12 gold
cs: 10 jídla za 12 zlata

source: 12 food for 10 wood
cs: 12 jídla za 10 dřeva

source: 12 food for 10 ore
cs: 12 jídla za 10 rud

source: 10 wood for 12 gold
cs: 10 dřeva za 12 zlata

source: 12 wood for 10 food
cs: 12 dřeva za 10 jídla

source: 12 wood for 10 ore
cs: 12 dřeva za 10 rud

source: 10 ore for 12 gold
cs: 10 rud za 12 dřeva

source: 12 ore for 10 wood
cs: 12 rud za 10 dřeva

source: 12 ore for 10 food
cs: 12 rud za 10 jídla

source: You do not have enough research points!
cs: Nemáš dost výzkumných bodů!

source: You currently have $player_resources[$side_number].rp research points. Your scholars produce $rp_income research points per turn. Researched technologies Spying: $player_technologies[$side_number].spying - Camouflage: $player_technologies[$side_number].camouflage Witchcraft: $player_technologies[$side_number].witchcraft Herbalism: $player_technologies[$side_number].herbalism Architecture: $player_technologies[$side_number].architecture Fortification: $player_technologies[$side_number].fortification Diplomacy: $player_technologies[$side_number].diplomacy Smithery: $player_technologies[$side_number].smithery Trading: $player_technologies[$side_number].trading - Trading Routes: $player_technologies[$side_number].trading_routes - Economy: $player_technologies[$side_number].economy Advanced Mining: $player_technologies[$side_number].mining Advanced Farming: $player_technologies[$side_number].farming Woodworking: $player_technologies[$side_number].woodworking
cs: V tuto chvíli máš $player_resources[$side_number].rp výzkumných bodů. Tví učenci vyprodukují $rp_income výzkumných bodů za kolo. Vyzkoumané technologie Vyzvědačství: $player_technologies[$side_number].spying - Kamufláž: $player_technologies[$side_number].camouflage Čarodějnictví: $player_technologies[$side_number].witchcraft Bylinkářství: $player_technologies[$side_number].herbalism Architektura: $player_technologies[$side_number].architecture Diplomacie: $player_technologies[$side_number].diplomacy Kovářství: $player_technologies[$side_number].smithery Obchod: $player_technologies[$side_number].trading - Obchodní cesty: $player_technologies[$side_number].trading_routes - Ekonomie: $player_technologies[$side_number].economy Pokročilá těžba: $player_technologies[$side_number].mining Zpracování dřeva: $player_technologies[$side_number].woodworking

source: Research new technology
cs: Vyzkoumat novou technologii

source: Which technology do you want to research?
cs: Jakou technologii chcete zkoumat?

source: technology^None
cs: Žádnou

source: Spying (20 research points)
cs: Vyzvědačství (20 výzkumných bodů)

source: Technology Spying researched. You can build towers and train scouts from now on.
cs: Technologie Vyzvědačství výzkoumána. Od teď můžeš stavět věže a trénovat zvědy.

source: Camouflage (30 research points)
cs: Kamufláž (30 výzkumných bodů)

source: Technology Camouflage researched. Your scouts can hide in forests and hills now.
cs: Technologie Kamufláž vyzkoumána. Tví zvědové se teď mohou skrývat v lesích a kopcích.

source: Witchcraft (20 research points)
cs: Čarodějnictví (20 výzkumných bodů)

source: Technology Witchcraft researched. You can train mages from now on. New upgrades are also available in Blacksmith.
cs: Technologie Čarodějnictví vyzkoumána. Od teď může trénovat mágy. Také jsou dostupné nové upgrady v kovárně.

source: Herbalism (20 research points)
cs: Bylinkářství (20 výzkumných bodů)

source: Technology Herbalism researched. You can build temples from now on.
cs: Technologie Bylinkářství vyzkoumána. Odteď můžeš stavět chrámy.

source: Architecture (25 research points)
cs: Architektura (25 výzkumných bodů)

source: Technology A researched. Your buildings will have 15% more hitpoints from now on.
cs: Technologie Architektura vyzkoumána. Tvé budovy budou mít odteď 15% více životů.

source: Fortification (15 research points)
cs: Opevnění (15 výzkumných bodů)

source: Technology Fortification researched. You can build forts now.
cs: Technologie Opevnění vyzkoumána. Můžeš stavět pevnosti.

source: Diplomacy (40 research points)
cs: Diplomacie (40 výzkumných bodů)

source: Technology Diplomacy researched. You can build embassy now.
cs: Technologie Diplomacie vyzkoumáma. Můžeš postavit velvyslanectví.

source: Smithery (30 research points)
cs: Kovářství (30 výzkumných bodů)

source: Technology Smithery researched. You can build blacksmith now.
cs: Technologie Kovářství vyzkoumána. Můžeš postavit kovárnu.

source: Trading (30 research points)
cs: Obchod (30 výzkumných bodů)

source: Technology Trading researched. You can build market now.
cs: Technologie Obchod vyzkoumána. Můžeš postavit tržiště.

source: Trading Routes (40 research points)
cs: Obchodní cesty (40 výzkumných bodů)

source: Technology Trading Routes researched. Your roads will generate some gold for you from now on.
cs: Technologie Obchodní cesty vyzkoumána. Tvá cesty odteď budou generovat nějaké zlato.

source: Economy (45 research points)
cs: Ekonomie (45 výzkumných bodů)

source: Technology Economy researched. Your cities will produce more gold from now on.
cs: Technologie Ekonomie vyzkoumána. Tvá města budou odteď produkovat více zlata.

source: Advanced Mining (30 research points)
cs: Pokročilá těžba (30 výzkumných bodů)

source: Technology Advanced Mining researched. Your mines will produce 1 more gold/ore per turn.
cs: Technologie Pokročilá těžba vyzkoumána. Tvé doly budou produkovat o 1 zlata/rudy více za kolo.

source: Advanced Farming (25 research points)
cs: Pokročilé zemědělství (25 výzkumných bodů)

source: Technology Advanced Farming researched. Your farms will produce more food per turn.
cs: Technologie Pokročilé zemědělství vyzkoumána. Tvé farmy budou produkovat více jídla za kolo.

source: Woodworking (25 research points)
cs: Zpracování dřeva (25 výzkumných bodů)

source: Technology Woodworking researched. You can build Woodcutter's Hut and completely chop down trees now.
cs: Technologie Zpracování dřeva výzkoumána. Od teď můžeš stavět dřevařovy chaty a kompletně skácet stromy.

source: Player $side_number reached $score_mode_score score. He/she wins!
cs: Hráč $side_number dosáhl $score_mode_score skóre. Vyhrává!

source: Tax Collector
cs: Výběrčí daní

source: Time to pay taxes, $player_title|. It's $current_tax gold marks this time.
cs: Je čas zaplatit daně, $player_title|. Dělá to $current_tax zlaťáků.

source: Here you go.
cs: Tady máš.

source: Very well. Next collector will come by you in 12 turns.
cs: Dobře. Další výběrčí za tebou příjde za 12 kol.

source: Uhm, I don't have enough money.
cs: Hmm, nemám dost peněz.

source: You'll be executed for your incompetence.
cs: Budeš popraven za svou neschopnost.

source: I'm not going to pay the old bastard anymore. I declare my province an independent kingdom!
cs: Nehodlám už dál platit tomu starému šmejdovi. Vyhlašuji mou provincii nezávislým královstvím!

source: title^Knight
cs: Rytíř

source: title^Baronet
cs: Baronet

source: title^Baron
cs: Baron

source: title^Marquis
cs: Markýz

source: title^Earl
cs: Hrabě

source: title^Duke
cs: Vévoda

source: title^King
cs: Král

source: title^Emperor
cs: Císař

source: Promote
cs: Povýšit

source: Your current title is $titles[$current_rank].name|. To be promoted to $titles[$next_rank].name|, you need to acquire at least $titles[$next_rank].score| points and pay $titles[$next_rank].gold| gold marks.
cs: Tvůj současný titul je $titles[$current_rank].name|. Aby jsi byl povýšen na $titles[$next_rank].name|, musíš získat alespoň $titles[$next_rank].score| bodů a zaplatit $titles[$next_rank].gold| zlaťáků.

source: Congratulation! You are ready to be promoted to $titles[$next_rank].name|. Do you really want it?
cs: Gratuluji! Můžeš být povýšen na $titles[$next_rank].name|. Opravdu to chceš?

source: You are $titles[$next_rank].name| from now on!
cs: Odteď jsi $titles[$next_rank].name|!

source: You are not ready for the next promotion yet. Improve your score and try again.
cs: Ještě nejsi připravený na povýšení. Vylepši své skóre a zkus to znovu.

source: You are not ready for the next promotion yet. Earn more gold and try again.
cs: Ještě nejsi připravený na povýšení. Získej více zlata a zkus to znovu.

source: What kind of soldier do you want to train?
cs: Jaký druh vojáka chcete trénovat?

source: soldier^None
cs: Žádný

source: $player_recruits[$side_number].fighter1.name ($player_recruits[$side_number].fighter1.gold_cost gold, $player_recruits[$side_number].fighter1.food_cost food)
cs: &$player_recruits[$side_number].fighter1.image|=$player_recruits[$side_number].fighter1.name ($player_recruits[$side_number].fighter1.gold_cost zlata, $player_recruits[$side_number].fighter1.food_cost jídla)

source: $player_recruits[$side_number].fighter2.name ($player_recruits[$side_number].fighter2.gold_cost gold, $player_recruits[$side_number].fighter2.food_cost food)
cs: &$player_recruits[$side_number].fighter2.image|=$player_recruits[$side_number].fighter2.name ($player_recruits[$side_number].fighter2.gold_cost zlata, $player_recruits[$side_number].fighter2.food_cost jídla)

source: $player_recruits[$side_number].tank1.name ($player_recruits[$side_number].tank1.gold_cost gold, $player_recruits[$side_number].tank1.food_cost food)
cs: &$player_recruits[$side_number].tank1.image|=$player_recruits[$side_number].tank1.name ($player_recruits[$side_number].tank1.gold_cost zlata, $player_recruits[$side_number].tank1.food_cost jídla)

source: $player_recruits[$side_number].tank2.name ($player_recruits[$side_number].tank2.gold_cost gold, $player_recruits[$side_number].tank2.food_cost food)
cs: &$player_recruits[$side_number].tank2.image|=$player_recruits[$side_number].tank2.name ($player_recruits[$side_number].tank2.gold_cost zlata, $player_recruits[$side_number].tank2.food_cost jídla)

source: $player_recruits[$side_number].archer1.name ($player_recruits[$side_number].archer1.gold_cost gold, $player_recruits[$side_number].archer1.food_cost food)
cs: &$player_recruits[$side_number].archer1.image|=$player_recruits[$side_number].archer1.name ($player_recruits[$side_number].archer1.gold_cost zlata, $player_recruits[$side_number].archer1.food_cost jídla)

source: $player_recruits[$side_number].archer2.name ($player_recruits[$side_number].archer2.gold_cost gold, $player_recruits[$side_number].archer2.food_cost food)
cs: &$player_recruits[$side_number].archer2.image|=$player_recruits[$side_number].archer2.name ($player_recruits[$side_number].archer2.gold_cost zlata, $player_recruits[$side_number].archer2.food_cost jídla)

source: $player_recruits[$side_number].scout1.name ($player_recruits[$side_number].scout1.gold_cost gold, $player_recruits[$side_number].scout1.food_cost food)
cs: &$player_recruits[$side_number].scout1.image|=$player_recruits[$side_number].scout1.name ($player_recruits[$side_number].scout1.gold_cost zlata, $player_recruits[$side_number].scout1.food_cost jídla)

source: $player_recruits[$side_number].scout2.name ($player_recruits[$side_number].scout2.gold_cost gold, $player_recruits[$side_number].scout2.food_cost food)
cs: &$player_recruits[$side_number].scout2.image|=$player_recruits[$side_number].scout2.name ($player_recruits[$side_number].scout2.gold_cost zlata, $player_recruits[$side_number].scout2.food_cost jídla)

source: What kind of healer do you want to train?
cs: Jaký druh léčitele chcete trénovat?

source: healer^None
cs: Žádný

source: $player_recruits[$side_number].healer1.name ($player_recruits[$side_number].healer1.gold_cost gold, $player_recruits[$side_number].healer1.food_cost food)
cs: &$player_recruits[$side_number].healer1.image|=$player_recruits[$side_number].healer1.name ($player_recruits[$side_number].healer1.gold_cost zlata, $player_recruits[$side_number].healer1.food_cost jídla)

source: $player_recruits[$side_number].healer2.name ($player_recruits[$side_number].healer2.gold_cost gold, $player_recruits[$side_number].healer2.food_cost food)
cs: &$player_recruits[$side_number].healer2.image|=$player_recruits[$side_number].healer2.name ($player_recruits[$side_number].healer2.gold_cost zlata, $player_recruits[$side_number].healer2.food_cost jídla)

source: What kind of unit do you want to train?
cs: Jaký druh jednotky chcete trénovat?

source: unit^None
cs: Žádnou

source: $player_recruits[$side_number].mage1.name ($player_recruits[$side_number].mage1.gold_cost gold, $player_recruits[$side_number].mage1.food_cost food)
cs: &$player_recruits[$side_number].mage1.image|=$player_recruits[$side_number].mage1.name ($player_recruits[$side_number].mage1.gold_cost zlata, $player_recruits[$side_number].mage1.food_cost jídla)

source: $player_recruits[$side_number].mage2.name ($player_recruits[$side_number].mage2.gold_cost gold, $player_recruits[$side_number].mage2.food_cost food)
cs: $player_recruits[$side_number].mage2.name ($player_recruits[$side_number].mage2.gold_cost zlata, $player_recruits[$side_number].mage2.food_cost jídla)

source: building
cs: budova

source: Immune to drain, poison, and plague
cs: Odolný vůči vysátí, jedu a nákaze

source: heroic
cs: hrdinný

source: female^heroic
cs: hrdinná

source: Cut down a tree
cs: Pokácet strom

source: $wood_gathered wood gathered.
cs: $wood_gathered dřeva nasbíráno.

source: Chop down a tree
cs: Skácet strom

source: Completely chopping down a tree will give you a lot of wood but prevents you from gaining more wood from this hex in the future. Are you sure that you want to chop down this tree?
cs: Kompletní skácení stromu ti dá hodně dřeva, ale zabrání ti v získání více dřeva z toho hexu v budoucnosti. Jsi si jistý, že chceš skácet tento strom?

source: 1p - EB - Southern Lands
cs: 1p - EB - Jižní země

source: You are a new noble and your task is to found a new province for your kingdom. The area is fitting for a new settlement but it seems that it is not completely uninhabited so you will have to find a way to befriend or conquer the residents. And what would happen if you even tried to become independent from your king?
cs: Jsi nový šlechtic a tvým úkolem je založit novou provincii pro tvé králoství. Oblast je vhodná pro nové osídlení ale zdá, že není zcela neobydlená, takže budeš muset najít způsob, jak si místní obyvatele spřátelit či podrobit. A co by se stalo, kdyby jsi se dokonce pokusil osamostanit od svého krále?

source: Player
cs: Hráč

source: South Star
cs: Jižní hvězda

source: Orcs
cs: Skřeti

source: Elves
cs: Elfové

source: Other Elves
cs: Jiní elfové

source: Dwarves
cs: Trpaslíci

source: 1p - EB - Tutorial
cs: 1p - EB - Tutoriál

source: Enemies
cs: Nepřátelé

source: Mentor
cs: Učitel

source: First remarkable thing about it is that you cannot recruit units from your castle. Instead, you have to build certain buildings (for example Barracks) first and then you can buy a unit.
cs: Jeho první zvláštností je, že tu neverbuješ jednotky ze svého hradu. Místo toho musíš nejprve postavit jisté budovy (například kasárny) a pak si můžeš koupit jednotku.

source: To construct a building you need a worker. You will start every scenario with at least 1 worker, more can be hired in Town Hall, City Hall, Tower House or Castle. Constructing a building costs you gold and wood. You can get wood by cutting down trees. To do it, move a worker to a forest, right-click him and select Cut down a tree. How to get gold will be explained later.
cs: Aby jsi postavil budovu, potřebuješ dělníka. Každý scénář začneš alespoň s jedním dělníkem, další si můžeš najmout v radnici, hradě nabo zámku. Postavení budovy tě stojí zlato a dřevo. Dřevo získáš kácení stromů. Aby jsi to udělal, přesuň dělníka do lesa, klikni na něj pravým tlačítkem a vyber Pokácet strom. Jak získat zlato bude vysvětleno podzěji.

source: You first task in this tutorial will be constructing Barracks and training a Spearman. To do it, right-click a worker and select Construct a building and in the menu that will appear then double click Barracks. Once you do it, you will receive next instructions.
cs: Tvým prvním úkolem v tomto tutoriálu bude postavit kasárnu a vycvičit kopiníka. Aby jsi to udělal, klikni pravým tlačítkem na dělníka a vyber Postavit budovu a v menu, které se objeví, dvakrát klikni na Kasárny. Jakmile to uděláš, dostaneš další instrukce.

source: Train a Spearman
cs: Vycvíč kopiníka

source: &scenery/tent-ruin-1.png=Barracks (25 gold, 12 wood)
cs: &scenery/tent-ruin-1.png=Kasárny (25 zlata, 12 dřeva)

source: Very well. This way you will be able to construct more buildings later. But back to training units.
cs: Velmi dobře. Takto budeš moct později postavit i další budovy. Ale zpět k trénování jednotek.

source: If you want to train a new unit, right-click a building and select Train soldiers. To train units you need gold and food. For now, you can train only spearmen but in other scenarios there will be more options. Also upgrading Barracks will allow you to train level 2 units. Keep in mind that in different building you can train different units.
cs: Pokud chceš vycvičit novou jednotku, klikni pravým tlačítkem na budovu a vyber Trénovat vojáky. Na trénování jednotek potřebuješ zlato a jídlo. V tuto chvíli můžeš trénovat jen kopiníky, ale v další scénářích budeš mít více možností. Také vylepšení kasáren ti umožní trénovat jednotky na úrovni 2. Měj na paměti, že v různých budovách můžeš trénovat odlišné jednotky.

source: But for now we want the Spearman so train one.
cs: Ale teď chceme kopiníka, tak jednoho vycvič.

source: &$player_recruits[$side_number].fighter1.image|=$player_recruits[$side_number].fighter1.name ($player_recruits[$side_number].fighter1.gold_cost gold, $player_recruits[$side_number].fighter1.food_cost food)
cs: &$player_recruits[$side_number].fighter1.image|=$player_recruits[$side_number].fighter1.name ($player_recruits[$side_number].fighter1.gold_cost zlata, $player_recruits[$side_number].fighter1.food_cost jídla)

source: Excellent. But we have got a problem now. In this modification, units do not require just upkeep every turn but also also food. If you do not have enough food for them, they will starve and lose some hitpoints.
cs: Výborně. Ale teď máme problém. V tomto rozšíření jednotky nevyžadují jen žold každé kolo ale také jídlo. Když pro ně nebudeš mít dostatek jídla, budou hladovět a ztrácet nějaké životy.

source: To avoid this, you have to build farms. It is done the same way as you built Barracks. So, hire a worker (from the Town Hall) and tell him to build a Farm.
cs: Aby jsi se tomu vyhnul, musíš stavět farmy. To se dělá stejně jako jsi postavil kasárnu. Takže najmi dělníka (z radnice) a a řekni mu, aby postavil farmu.

source: Build a Farm
cs: Postav farmu

source: &scenery/windmill-01.png=Farm (12 gold, 7 wood)
cs: &scenery/windmill-01.png=Farmu (12 zlata, 7 dřeva)

source: Good job. But as you can see, you spent almost all of your gold. It is very easy but there are some ways to earn gold. The first one is founding new cities. Their central buildings collect gold from taxes.
cs: Dobrá práce. Ala jak vidíš, utratil jsi téměř všechno své zlato. To je velmi snadné, ale je několik způsobů jak získat zlato. Prvním je zakládání měst. Jejich hlavní budovy sbírají zlato z daní.

source: Only your leader can found new cities (via right-click menu). The maximum number of cities that you can build depends on your noble title. You start as a Knight and can have only 3 cities. Also if you upgrade your cities, they will produce more gold. But for it you need a higher title.
cs: Jen tvůj vůdce může zakládat nová města. Maximální počet měst, která můžeš postavit, závisí na tvém šlechtickém titulu. Začínáš jako rytíř a můžeš mít pouze 3 města. Také když svá města vylepšíš, budou vyrábět více zlata. Ale na to potřebuješ vyšší titul.

source: The second way to improve your income is building gold mines and you will learn it now. It is similar to building farms and barracks. You right-click a worker but now you select Build a mine and in the next menu Gold Mine. But unlike other building, mines can be built only on hills or mountains. So why do you not try it now?
cs: Druhý způsob jak vylepšit příjmy je stavění zlatých dolů a to se teď naučíš. Je to podobné stavění farem a kasáren. Klikneš pravým tlačítkem na dělníka, ale tentokrát vybereš Postavit důl a v dalším menu Zlatý důl. Ale narozdíl od ostatních budov, doly mohou být vybudovány jen na kopcíh a horách. Tak proč to nezkusíš?

source: Build a Gold Mine
cs: Postav zlatý důl

source: Alright, now you will earn 2 gold and food per turn. Upgrading a mine would increase your income. You can do that right-clicking the mine and selecting Upgrade this building. It applies to other buildings as well though this is not possible in the tutorial. So moving on ...
cs: Dobrá, teď budeš získávat 2 zlata a jídla za kolo. Vylepšení dolu by vylepšilo tvůj příjem. Můžeš to udělat kliknutím pravým tlačítkem na důl vybráním Vylepšit tuto budovu. To platí i na další budovy, ale toto není možné v tutoriálu. Takže jdeme dál ...

source: Well, next step is ending your turn. At the start of your next turn you will get that 2 gold and food. That and the lesson will continue. So ...
cs: No, dalším krokem je ukončení tahu. Na začátku příštího tahu dostaneš zmíněné 2 zlata a jídla. A taky lekce bude pokračovat. Takže ...

source: Now you have a bit more gold and food. But wait, something is wrong.
cs: Teď máš trochu více zlata a jídla. Ale počkat, něco není v pořádku.

source: The Elves are attacking us! ... Well, maybe not. It does not seem that they are going to fight. Then I guess that they want to end the war between us. But they will not talk to us until we build an Embassy.
cs: Elfové na nás útočí! ... No, možná ne. Nevypadá to, že by chtěli bojovat. Pak hádám, že chtějí ukončit válku mezi námi. Ale nebudou s námi mluvit, dokud nepostavíme velvyslanectví.
