Repository: konecnyjakub/Empire_Builder
Catalog: translations/wesnoth-Empire_Builder/*.po
Languages: cs

source: Konrad
cs: Konrád

source: Grogdish
cs: Grogdiš

source: This feature is not implemented yet.
cs: Tato funkce ještě není implementovaná.

source: Dominate the area
cs: Ovládni oblast

source: Reach $score_mode_score score
cs: Dosáhni $score_mode_score skóre

source: Death of your leader
cs: Tvůj vůdce umře

source: Destruction of your headquarters
cs: Tvé velitelství je zničené

source: Someone else reach $score_mode_score score
cs: Někdo jiný dosáhne $score_mode_score skóre

source: Before you can start the game, you have to choose name for your main character. Your noble title will come before it.
cs: Ještě než začneš hrát, musíš si vybrat jméno pro svou hlavní postavu. Tvůj šlechtický titul mu bude předcházet.

source: The name of your character:
cs: Jméno tvé postavy:

source: camouflage
cs: maskování

source: This unit can hide in forests and hills, and remain undetected by its enemies. Enemy units cannot see this unit while it is in forests and hills, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
cs: Jednotka se dokáže ukrýt v lese a kopcíh a zůstat nezpozorována svými nepřáteli. Nepřátelské jednotky nemohou tuto jednotku spatřit v lese a kopcích, pouze jsou-li na sousedních polích. Nepřátelská jednotka, která ji nalezne jako první, ztrácí všechny své zbývající body pohybu.

source: You do not have enough ores!
cs: Nemáš dost rud!

source: You currently have $player_resources[$side_number].ore ores. Your mines produce $ore_income ores per turn. Researched upgrades Sharp Blade I: $player_upgrades[$side_number].sharp_blade1 Sharp Blade II: $player_upgrades[$side_number].sharp_blade2 Fire Arrows: $player_upgrades[$side_number].fire_arrows Piercing Arrow I: $player_upgrades[$side_number].piercing_arrow1 Piercing Arrow II: $player_upgrades[$side_number].piercing_arrow2 Shield: $player_upgrades[$side_number].shield Armor I: $player_upgrades[$side_number].armor1 Armor II: $player_upgrades[$side_number].armor2 Anti-magic Shield I: $player_upgrades[$side_number].magic_shield1 Anti-magic Shield II: $player_upgrades[$side_number].magic_shield2 Mystic Power: $player_upgrades[$side_number].mystic_power
cs: V tuto chvíli máš $player_resources[$side_number]ore rud. Tvé doly vyprodukují $ore_income rud za kolo. Vyzkoumané upgrady Ostrá čepel I: $player_upgrades[$side_number].sharp_blade1 Ostrá čepel II: $player_upgrades[$side_number].sharp_blade2 Ohivé šípy: $player_upgrades[$side_number].fire_arrows Pronikavý šíp I: $player_upgrades[$side_number].piercing_arrow1 Pronikavý šíp II: $player_upgrades[$side_number].piercing_arrow2 Štít: $player_upgrades[$side_number].shield Brnění I: $player_upgrades[$side_number].armor1 Brnění II: $player_upgrades[$side_number].armor2 Antimagický štít I: $player_upgrades[$side_number].magic_shield1 Antimagický štít II: $player_upgrades[$side_number].magic_shield2 Mystická síla: $player_upgrades[$side_number].mystic_power

source: Back
cs: Zpět

source: Research new upgrade
cs: Vyzkoumat nový upgrade

source: Which upgrade do you want to research?
cs: Jaký upgrade chcete zkoumat?

source: upgrade^None
cs: Žádný

source: Sharp Blade I (15 ores)
cs: Ostrá čepel I (15 rud)

source: Upgrade Sharp Blade I researched. Your units will deal 1 more damage with bladed weapons from now on.
cs: Upgrade Ostrá čepel I vyzkoumán. Tvé jednotky budou odteď způsobovat o 1 více poškození zbraněmi s čepelí.

source: Sharp Blade II (20 ores)
cs: Ostrá čepel II (20 rud)

source: Upgrade Sharp Blade II researched. Your units will deal 1 more damage with bladed weapons from now on.
cs: Upgrade Ostrá čepel II vyzkoumán. Tvé jednotky budou odteď způsobovat o 1 více poškození zbraněmi s čepelí.

source: Fire Arrows (25 ores)
cs: Ohnivé šípy (25 rud)

source: Upgrade Fire Arrows researched. Your archers will deal fire damage now.
cs: Upgrade Ohnivé šípy vyzkoumán. Tví lučištníci teď budou způsobovat ohnivé poškození.

source: Piercing Arrow I (10 ores)
cs: Pronikavý šíp I (10 rud)

source: Upgrade Piercing Arrow I researched. Your units will deal 1 more damage with ranged weapons from now on.
cs: Upgrade Pronikavý šíp I vyzkoumán. Tvé jednotky odteď budou způsobovat o 1 více poškození zbraněmi na dálku.

source: Piercing Arrow II (15 ores)
cs: Pronikavý šíp II (15 rud)

source: Upgrade Piercing Arrow II researched. Your units will deal 1 more damage with ranged weapons from now on.
cs: Upgrade Pronikavý šíp II vyzkoumán. Tvé jednotky odteď budou způsobovat o 1 více poškození zbraněmi na dálku.

source: Shield (25 ores)
cs: Štít (25 rud)

source: Upgrade Shield researched. Your units will have 7% higher defense on all terrains.
cs: Upgrade Štít I vyzkoumán. Tvé jednotky budou mít odteď o 7% vyšší obranu na všech terénech.

source: Armor I (20 ores)
cs: Brnění I (20 rud)

source: Upgrade Armor I researched. Your units will receive 5% less damage from physical attacks from now on.
cs: Upgrade Brnění I vyzkoumán. Tvé jednotky odteď utrpí o 5% méně poškození z fyzických útoků.

source: Armor II (30 ores)
cs: Brnění II (30 rud)

source: Upgrade Armor II researched. Your units will receive 10% less damage from physical attacks from now on.
cs: Upgrade Brnění II vyzkoumán. Tvé jednotky odteď utrpí o 10% méně poškození z fyzických útoků.

source: Anti-magic shield I (20 ores)
cs: Antimagický štít I (20 rud)

source: Upgrade Anti-magic Shield I researched. Your units will receive 7% less damage from magical attacks from now on.
cs: Upgrade Antimagický štít I vyzkoumán. Tvé jednotky odteď utrpí o 7% méně poškození z magických útoků.

source: Anti-magic shield II (30 ores)
cs: Antimagický štít II (30 rud)

source: Upgrade Anti-magic Shield II researched. Your units will receive 8% less damage from magical attacks from now on.
cs: Upgrade Antimagický štítII vyzkoumán. Tvé jednotky odteď utrpí o 8% méně poškození z magických útoků.

source: Mystic Power (25 ores)
cs: Mystická síla (25 rud)

source: Upgrade Mystic Power researched. Your mages and healers will deal 2 more damage from now on.
cs: Upgrade Mystická síla vyzkoumán. Tví magové a léčitelé od teď budou způsobovat o 2 více poškození.

source: You do not have enough resources!
cs: Nemáš dost zdrojů!

source: Construct a building
cs: Postavit budovu

source: Build a mine
cs: Postavit důl

source: Construct road (3 gold)
cs: Vybudovat cestu (3 zlata)

source: Demolish this building
cs: Zbořit tuto budovu

source: After demolishing the building, you will get half of the invested gold and wood back but lose the score. Do you really want to do that?
cs: Po zboření budovy dostaneš zpět polovinu investovaného zlata a dřeva ale ztratíš skóre. Opravdu to chceš udělat?

source: No
cs: Ne

source: Yes
cs: Ano

source: Building demolished. You got $unit.variables.gold_cost gold and $unit.variables.wood_cost wood but lost $unit.variables.score points.
cs: Budova zbourána. Dostal jsi $unit.variables.cost zlata a $unit.variables.wood_cost dřeva, ale ztratil $unit.variables.score bodů.

source: Found a new city
cs: Založit nové město

source: What kind of building do you want me to construct?
cs: Jaký druh budovy chcete, abych postavil?

source: building^None
cs: Žádnou

source: Farm (12 gold, 7 wood)
cs: Farmu (10 zlata, 7 dřeva)

source: Barracks (25 gold, 12 wood)
cs: Kasárny (25 zlata, 12 dřeva)

source: Temple (30 gold, 4 wood)
cs: Chrám (30 zlata, 4 dřeva)

source: School (40 gold, 4 wood)
cs: Školu (40 zlata, 4 dřeva)

source: Embassy (60 gold, 10 wood)
cs: Velvyslanectví (60 zlata, 10 dřeva)

source: Blacksmith (40 gold, 8 wood)
cs: Kovárnu (40 zlata, 8 dřeva)

source: Market (60 gold, 10 wood)
cs: Tržiště (60 zlata, 10 dřeva)

source: Hall of Heroes (30 gold, 30 wood)
cs: Síň hrdinů (30 zlata, 30 dřeva)

source: Tower (8 gold, 6 wood)
cs: Věž (8 zlata, 6 dřeva)

source: Woodcutter's Hut (10 gold, 5 wood)
cs: Dřevařovu chatu (10 zlata, 5 dřeva)

source: Fortress (35 gold, 15 wood)
cs: Pevnost (35 zlata, 15 dřeva)

source: What kind of mine do you want me to build?
cs: Jaký druh dolu chcete, abych postavil?

source: mine^None
cs: Žádný

source: Gold mine
cs: Zlatý důl

source: Ore mine
cs: Rudný důl

source: Upgrade this building
cs: Vylepšit tuto budovu

source: Town Hall upgraded.
cs: Radnice vylepšena

source: City Hall upgraded.
cs: Radnice vylepšena

source: Tower House upgraded.
cs: Hrad vylepšen.

source: Gold Mine upgraded.
cs: Zlatý důl vylepšen.

source: Ore Mine upgraded.
cs: Rudný důl vylepšen.

source: Farm upgraded.
cs: Farma vylepšena.

source: School upgraded.
cs: Škola vylepšena.

source: Woodcutter's Hut upgraded.
cs: Dřevařova chata vylepšen.

source: Barracks upgraded.
cs: Kasárny vylepšeny.

source: Hall of Heroes upgraded.
cs: Síň hrdinů vylepšena.

source: Fortress upgraded.
cs: Pevnost vylepšena.

source: Economy overview
cs: Ekonomický přehled

source: Hire a worker
cs: Najmout dělníka

source: Research
cs: Výzkum

source: Train a unit
cs: Trénovat jednotku

source: Blacksmith
cs: Kovárna

source: Train soldiers
cs: Trénovat vojáky

source: Diplomacy
cs: Diplomacie

source: Train a healer
cs: Trénovat léčitele

source: Exchange resources
cs: Vyměnit zdroje

source: Summon a Hero
cs: Povolat hrdinu

source: Gold
cs: Zlato

source: Your income from taxes and gold mines is $gold_income gold marks per turn, your expenses are $gold_expenses per turn. You earn $net_gold_income gold marks per turn.
cs: Tvůj příjem z daní a zlatých dolů je $gold_income zlaťáků za kolo, tvé výdaje jsou $gold_expenses za kolo. Získáváš $net_gold_income zlaťáků za kolo.

source: Your income from taxes and gold mines is $gold_income gold marks per turn, your expenses are $gold_expenses per turn. You lose $net_gold_income gold marks per turn.
cs: Tvůj příjem z daní a zlatých dolů je $gold_income zlaťáků za kolo, tvé výdaje jsou $gold_expenses za kolo. Ztrácíš $net_gold_income zlaťáků za kolo.

source: Food
cs: Jídlo

source: Your farms produce $food_income food per turn, your soldiers require $food_expenses per turn. You earn $net_food_income food per turn.
cs: Tvé farmy vyprodukují $food_income jídla za kolo, tví vojáci vyžadují $food_expenses za kolo. Získáváš $net_food_income jídla za kolo.

source: Your farms produce $food_income food per turn, your soldiers require $food_expenses per turn. You lose $net_food_income food per turn.
cs: Tvé farmy vyprodukují $food_income jídla za kolo, tví vojáci vyžadují $food_expenses za kolo. Ztrácíš $net_food_income jídla za kolo.

source: Wood
cs: Dřevo

source: Your woodcutters produce $wood_income wood per turn.
cs: Tví dřevaři vyprodukují $wood_income dřeva za kolo.

source: Ore
cs: Ruda

source: Your ore mines produce $ore_income ore per turn.
cs: Tvé doly vyprodukují $ore_income rudy za kolo.

source: Your scholars produce $rp_income research points per turn.
cs: Tví učenci vyprodukují $rp_income výzkumných bodů za kolo.

source: Your current resources: $current_gold gold marks, $player_resources[$side_number].food food, $player_resources[$side_number].wood wood, $player_resources[$side_number].ore ores and $player_resources[$side_number].rp research points. Your current score is $player_info[$side_number].score
cs: Tvé současné zdroje: $current_gold zlaťáků, $player_resources[$side_number].food jídla, $player_resources[$side_number].wood dřeva, $player_resources[$side_number].ore rud a $player_resources[$side_number].rp výzkumných bodů. Tvé současné skóre je $player_info[$side_number].score

source: Put this unit into fort
cs: Poslat tuto jednotku do pevnosti

source: There is no space for this unit on any nearby fort.
cs: Na žádné blízké pevnosti není místo pro tuto jednotku.

source: Show units
cs: Zobrazit jednotky

source: Units in this fort
cs: Jednotky v této pevnosti

source: Put this unit into tower
cs: Poslat tuto jednotku do věže

source: Dismiss archer
cs: Propustit lučištníka

source: Side $side_number lost its headquarters!
cs: Strana $side_number ztratila své velitelství!

source: Move headquarters here
cs: Přesunout velitelství zde

source: About
cs: O éře

source: Noble titles
cs: Šlechtické tituly

source: Your leader is a nobleman (usually Knight at the start of scenario). You can improve his title after reaching required score and paying certain amount of gold. With higher noble titles, you can build more cities, sometimes it also unlocks new options. Title Score Gold Cities Additional notes Knight 0 0 3 Baronet 130 30 5 You can upgrade Town Hall for first time Baron 320 60 8 You can train level 2 healers, upgrade Barracks and Fortress and build Hall of Heroes Marquis 500 120 10 You can upgrade Town Hall for second time Earl 900 250 15 You can upgrade Hall of Heroes Duke 1350 520 18 You can upgrade Town Hall for third time King 1750 1100 20 Emperor 2200 2300 100
cs: Tvůj vůdce je šlechtic (obvykle Rytíř na začátku scénáře). Můžeš vylepšit jeho titul po dosažení požadovaného skóre a zaplacení jistého množství zlata. S vyššími šlechtickými tituly můžeš postavit více měst, někdy to také odemkne nové možnosti. Titul Skóre Zlata Měst Dodatečné poznámky Rytíř 0 0 3 Baronet 130 30 5 Můžeš poprvé vylepšit radnici Baron 320 60 8 Můžeš trénovat léčitele úrovně 2, vylepšit kasárny a pevnost a postavit Síň hrdinů Markýz 500 120 10 Můžeš podruhé vylepšit radnici Hrabě 900 250 15 Můžeš vylepšit Síň hrdinů Vévoda 1350 520 18 Můžeš optřetí vylepšit radnici Král 1750 1100 20 Císař 2200 2300 100

source: Buildings
cs: Budovy

source: Buildings are constructed by workers for gold and wood. Some of them can be upgraded to produce more resources/train higher level units. You can demolish them to get back half of their cost. Mines can be built on hills and mountains, woodcutter's hut next to forests and towers on any terrain. All other buildings can be constructed on grassland or roads. Town Hall - central building of a village, produces gold. Can be upgraded 3 times. Farm (12 gold, 7 wood) - produces food. Can be upgraded 1 time. Barracks (25 gold, 12 wood) - allows you to train units. Can be upgraded 1 time. Temple (30 gold, 4 wood) - allows you to train healers, also heals adjacent allied units. Cannot be upgraded. Requires technology Herbalism. School (40 gold, 4 wood) - produces research points. Can be upgraded 1 time. Embassy (60 gold, 10 wood) - allows you to maintain your relationships with other states. Cannot be upgraded. You can build only 1. Requires technology Diplomacy. Blackmsmith (40 gold, 8 wood) - researches upgrades for units. Cannot be upgraded. You can build only 1. Requires technology Smithery. Market (60 gold, 10 wood) - produces gold, allows you to exchange resources and trade with other states. Cannot be upgraded. You can build only 1. Requires technology Trading. Tower (8 gold, 6 wood) - used to observe a small surrounding area. Cannot be upgraded. Requires technology Spying. Gold mine (18 gold, 5 wood) - produces gold. Can be upgraded 1 time. Ore mine (18 gold, 5 wood) - produces ore. Can be upgraded 1 time. Woodcutter's Hut (10 gold, 5 wood) - produces wood. Can be upgraded 1 time. Requires technology Woodworking. Fortress (35 gold, 15 wood) - provides food for stationed units, heals them a bit at the start of our turn. Can be upgraded 1 time. Requires technology Fortification. Hall of Heroes (30 gold, 30 wood) - allows you to summon special units (stronger than common ones). You can have only 1 unit of each type at the same time. Can be upgraded 1 time. Requires title Baron (and Earl for upgrading).
cs: Budovy jsou stavěny dělníky za zlato a dřevo. Některé mohou být vylepšeny, aby produkovaly více zdroj/aby jsi mohl trénovat jednotky na vyšší úrovni. Můžeš je zbořit a získat zpět polovinu jejich ceny. Doly mohou být stavěny v kopcích a horách, dřevařovy chaty vedle lesů a věže na jakémkoliv terénu. Všechny ostatní budovy mohou být stavěny na loukách nebo cestách.Radnice - hlavní budova vesnice, produkuje zlato. Může být vylepšena třikrát. Farma (12 zlata, 7 dřeva) - produkuje jídlo. Může být vylepšena jednou. Kasárny (25 zlata, 12 dřea) - umožňují ti trénovat jednotky. Mohou být vylepšeny jednou. Chrám (30 zlata, 4 dřeva) - umožňuje ti trénovat léčitele, taky léčí přílehlé spojenecké jednotky. Nemůže být vylepšen. Vyžaduje technologii Bylinkářství. Škola (40 zlata, 4 dřeva) - produkuje výzkumné body. Může být vylepšena jednou. Velvyslanectví (60 zlata, 10 dřeva) - umožňuje ti spravovat vztahy s ostatními státy. Nemůže být vylepšeno. Můžeš postavit jen jedno. Vyžaduje technologii Diplomacie. Kovárna (40 zlata, 8 dřeva) - zkoumá upgrady pro jednotky. Nemůže být vylepšena. Můžeš postavit jen jednu. Vyžaduje technologii Kovářství. Tržiště (60 zlata, 10 dřeva) - produkuje zlato, umožňuje ti vyměňovat zdroje a obchodovat s ostáními státy. Nemůže být vylepšeno. Můžeš postavit jen jedno. Vyžaduje technologii Obchod. Věž (8 zlata, 6 dřeva) - používá se k pozorování malé přilehlé oblasti. Nemůže být vylepšena. Vyžaduje technologii Vyzvědačství. Zlatý důl (18 zlata, 5 dřeva) - produkuje zlato. Může být vylepšen jednou. Rudný důl (18 zlata, 5 dřeva) - produkuje rudu. Může být vylepšen jednou. Pevnost (35 zlata, 15 dřeva) - poskytuje jídlo pro umístěné jednotky, trochu je léčí na začátku našeho kolo. Může být vylepšena jednou. Vyžaduje technologii Opevnění. Síň hrdinů (30 zlata, 30 dřeva) - umožňuje ti povolat speciální jednotky (silnější než normální). Můžeš mít jen jednu jednotku každého typu ve stejnou chvíli. Může být vylepšena jednou. Vyžaduje titul Baron (a Hrabě pro vylepšení).

source: Resources
cs: Zdroje

source: Technologies
cs: Technologie

source: Can be researched in School/University for research points. Spying (20 rp): allows you to build towers and train scouts in Barracks - Camouflage (30 rp): your scouts can hide in forests and hills Witchcraft (20 rp): allows you to train mages in School/University, unlocks upgrades Anti-magic Shield I, Anti-magic Shield II, Mystic Power Herbalism (20 rp): allows you to build temples Architecture (25 rp): your buildings will have 15% more hitpoints Fortification (15 rp): allows you to build forts Diplomacy (40 rp): allows you to build Embassy Smithery (30 rp): allows you to build Blacksmith Trading (30 rp): allows you to build Market - Trading Routes (40 rp): your roads will generate gold every turn - Economy (45 rp): you cities will produce more gold Advanced Mining (30 rp): you mines will produce 1 more gold/ore per turn Advanced Farming (25 rp): you farms will produce more food per turn Woodworking (25 rp): allows you to build Woodcutter's Hut and completely chop down trees
cs: Mohou být vyzkoumány ve škole/univerzitě za výzkumné body. Vyzvědačství (20 vb): umožňí ti stavět věže a trénovat zvědy v kasárnách - Kamufláž (30 vb): tví zvědové se mohou skrýt v lesích a kopcích Čarodějnictví (20 vb): umožňuje ti trénovat mágy ve škole/univerzitě, odemyká upgrady Antimagický štít 1, Animagický štít 2, Mystická síla Bylinkářství (20 vb): umožňuje ti stavět chrámy Architerktura (20 vb): tvé budovy budou mít o 15% více životů Diplomacie (40 vb): můžeš postavit velvyslanectví Kovářství (30 vb): můžeš postavit kovárnu Obchod (30 vb): můžeš postavit tržiště - Obchodní cesty (40 vb):tvé cesty budou generovat zlato každé kolo - Ekonomie (45 vb): tvá města budou produkovat více zlata Pokročilá těžba (30 vb): tvé doly vyprodukují o 1 více zlata/rudy za kolo Pokročilé zemědělství (30 vb): tvé farmy vyprodukují více jídla za kolo Zpracování dřeva (25 vb): umožňuje ti stavět dřevařovy chaty a kompletně skácet stromy

source: Upgrades
cs: Upgrady

source: Can be researched in Blacksmith for ores. Sharp Blade I (15 ores): your units will deal 1 more damage with bladed weapons - Sharp Blade II (20 ores): your units will deal 1 more damage with bladed weapons Fire Arrows (25 ores): your archers will deal fire damage Piercing Arrow I (10 ores): your units will deal 1 more damage with ranged weapons - Piercing Arrow II (15 ores): your units will deal 1 more damage with ranged weapons Shield (25 ores): your units will have 7% higher defense on all terrains Armor I (20 ores): your units will receive 5% less from physical attacks - Armor II (30 ores): your units will receive 10% less from physical attacks Anti-magic Shield I (20 ores): your units will receive 7% less from magical attacks (requires Witchcraft technology) - Anti-magic Shield II (30 ores): your units will receive 8% less from magical attacks (requires Witchcraft technology) Mystic Power (30 ores): your mages and healers will deal 2 more damage (requires Witchcraft technology)
cs: Mohou být vyzkoumány v kovárně za rudy. Ostrá čepel I (15 rud): tvé jednotky budou způsobovat o 1 více poškození zbraněmi s čepelí - Ostrá čepel II (20 rud): tvé jednotky budou způsobovat o 1 více poškození zbraněmi s čepelí Ohnivé šípy (25 rud): tví lučištníci budou způsobovat ohnivé poškození Pronikavý šíp I (10 rud): tvé jednotky budou způsobovat o 1 více poškození zbraněmi na dálku - Pronikavý šíp II (15 rud): tvé jednotky budou způsobovat o 1 více poškození zbraněmi na dálku Štít (25 rud): tvé jednotky budou mít o 7% vyšší obranu na všech terénech Brnění I (20 rud): tvé jednotky utrpí o 5% méně poškození z fyzických útoků - Brnění II (30 rud): tvé jednotky utrpí o 10% méně poškození z fyzických útoků Antimagický štít I (20 rud): tvé jednotky utrpí o 7% méně poškození z magických útoků (vyžaduje technologii čarodějnictví) - Anti-magic shield II (30 ores): tvé jednotky utrpí o 8% méně poškození z magických útoků (vyžaduje technologii čarodějnictví) Mystická síla (25 rud): tví magové a léčitelé budou způsobovat o 2 více poškození (vyžaduje technologii čarodějnictví)

source: What kind of hero do you want to summon?
cs: Jaký druh hrdiny chcete povlat?

source: hero^None
cs: Žádný

source: $player_recruits[$side_number].hero11.name ($player_recruits[$side_number].hero11.gold_cost gold, $player_recruits[$side_number].hero11.food_cost food)
cs: &$player_recruits[$side_number].hero11.image|=$player_recruits[$side_number].hero11.name ($player_recruits[$side_number].hero11.gold_cost zlata, $player_recruits[$side_number].hero11.food_cost jídla)

source: $player_recruits[$side_number].hero12.name ($player_recruits[$side_number].hero12.gold_cost gold, $player_recruits[$side_number].hero12.food_cost food)
cs: &$player_recruits[$side_number].hero12.image|=$player_recruits[$side_number].hero12.name ($player_recruits[$side_number].hero12.gold_cost zlata, $player_recruits[$side_number].hero12.food_cost jídla)

source: $player_recruits[$side_number].hero21.name ($player_recruits[$side_number].hero21.gold_cost gold, $player_recruits[$side_number].hero21.food_cost food)
cs: &$player_recruits[$side_number].hero21.image|=$player_recruits[$side_number].hero21.name ($player_recruits[$side_number].hero21.gold_cost zlata, $player_recruits[$side_number].hero21.food_cost jídla)

source: $player_recruits[$side_number].hero22.name ($player_recruits[$side_number].hero22.gold_cost gold, $player_recruits[$side_number].hero22.food_cost food)
cs: &$player_recruits[$side_number].hero22.image|=$player_recruits[$side_number].hero22.name ($player_recruits[$side_number].hero22.gold_cost zlata, $player_recruits[$side_number].hero22.food_cost jídla)

source: $player_recruits[$side_number].hero31.name ($player_recruits[$side_number].hero31.gold_cost gold, $player_recruits[$side_number].hero31.food_cost food)
cs: &$player_recruits[$side_number].hero31.image|=$player_recruits[$side_number].hero31.name ($player_recruits[$side_number].hero31.gold_cost zlata, $player_recruits[$side_number].hero31.food_cost jídla)
