Repository: konecnyjakub/Empire_Builder
Catalog: translations/wesnoth-Empire_Builder/*.po
Languages: cs

source: Before you can construct certain buildings, like Embassy, you need to research a technology. This can be done in School. Schools produce research points that can be used to research a new technology. The list of all technologies with their effects can be found under right-click menu item Empire Builder Help/Technologies.
cs: Než můžeš postavit jisté budovy, jako velvyslanectví, musíš vyzkoumat technologii. To se dělá ve škole. Školy produkují výzkumné body, které mohou být použity na výzkum nové technologie. Seznam všech technologií s jejich efekty můžeš najít v položce menu po kliknutí pravým tlačítkem Nápověda Věk říší/Technologie.

source: We need an Embassy now which requires technology Diplomacy. So build a School firstly, then you will learn how to research technologies. You received enough resources for it.
cs: My potřebujueme velvyslanectví, což vyžaduje technologii Diplomacie. Takže nejdřív školu, pak se naučít jak zkoumat technologie. Dostal jsi na to dostatek zdrojů.

source: &terrain/village/elven2.png=School (40 gold, 4 wood)
cs: &terrain/village/elven2.png=Školu (40 zlata, 4 dřeva)

source: Build an Embassy
cs: Postavit velvyslanectví

source: Very well. Now you have a School, it will produce 2 research points a turn (5 if upgraded). Diplomacy costs 40 research points. Gathering them would take too much time so you will receive them right now.
cs: Velmi dobře. Teď máš školu, ta bude produkovat 2 výzkumnné body za kolo (5 je-li vylepšená). Diplomacie stojí 40 výzkumných bodů. Jejich shromažďování by zabralo příliš mnoho času, proto je dostaneš okamžitě.

source: So you have enough research points but do not know how to research, right? Well, it is quite simple. Right-click a School or University, then select Research new technology and in the next menu choose one. For now, you have only 1 option - Diplomacy. So, research it.
cs: Takže máš dostatek výzkumných bodů, ale nevíš jako zkoumat, že? No, je to docela jednoduché. Klikni pravým tlačítkem na školu nebo univerzitu, pak vyber Vyzkoumat novou technologii a v následujím menu si nějakou vyber. Právě teď máš jen 1 možnost - Diplomacie. Tak jí vyzkoumej.

source: &scenery/mausoleum01.png~SCALE(72,72)=Embassy (60 gold, 10 wood)
cs: &scenery/mausoleum01.png~SCALE(72,72)=Velvyslanectví (60 zlata, 10 dřeva)

source: Excellent! Well, I was right, they want to conclude peace. They even offer you some goods if you accept. To see details, right-click your Embassy and select Diplomacy.
cs: Výborně! No, měl jsem pravdu, chtějí uzavřít mír. Dokonce ti nabízejí nějaké zboží, pokud příjmeš. K zobrazení detailů klikni pravým tlačítkem na své velvyslanectí a vyber Diplomacie.

source: Your current relationships: Side 2 - orcs (Vridish) - enemies Side 3 - elves (Fyrion) - enemies You have the following pending declarations:
cs: Tvé současné vztahy: Strana 2 - skřeti (Vridish) - nepřátelé Strana 3 - elfové (Fyrion) - nepřátelé Následující prohlášení čekají na vyřízení:

source: Peace treaty - side 3 (View details)
cs: Mírová smlouva - strana 3 (Zobrazit detaily)

source: Leader of side 3 (Fyrion) proposed you a peace treaty. He will send you 120 gold marks, 20 food and 20 ores if you accept. But he requires you to assist him in fighting side 2 (orcs). Do you accept?
cs: Vůdce strany 3 (Fyrion) ti nabídl mírovou smlouvu. Pošle ti 120 zlaťáků, 20 jídla a 20 rud, pokud příjmeš. Ale vyžaduje, aby jsi mu pomohl bojovat proti straně 2 (skřetům). Příjímáš?

source: Upgrades can be researched at Blacksmith. But to be able to build it, you need to research technology Smithery in School firstly. I gave you enough research points for that.
cs: Upgrady se zkoumají v kovárně. Ale aby jsi jí mohl postavit, musíš nejdříve ve škole vyzkoumat technologii kovářství. Dal jsem ti k tomu nezbytné množství výzkumných bodů.

source: Build Blacksmith
cs: Postavit kovárnu

source: &scenery/tent-shop-weapons.png=Blacksmith (40 gold, 8 wood)
cs: &scenery/tent-shop-weapons.png=Kovárnu (40 zlata, 8 dřeva)

source: Upgrade Armor I researched. Your units will receive 5% less from physical attacks from now on.
cs: Upgrade Brnění I vyzkoumán. Tvé jednotky odteď utrpí o 5% méně poškození z fyzických útoků.

source: Defeat orcs' leader
cs: Poraz vůdce skřetů

source: Basic Barracks
cs: Základní kasárny

source: Barracks allow you to train soldiers. In the basic version you can train level 1 soldiers.
cs: Kasárny ti umožňují trénovat vojáky. V základní verzi můžeš trénovat vojáky na úrovní 1.

source: Advanced Barracks
cs: Vylepšené kasárny

source: Barracks allow you to train soldiers. In the advanced version you can train level 1 and 2 soldiers.
cs: Kasárny ti umožňují trénovat vojáky. Ve vylepšené verzi můžeš trénovat vojáky na úrovní 1 a 2.

source: Blacksmith produces better weapons and armors for your soldiers.
cs: Kovář vyrábí lepší zbraně a brnění pro tvé vojáky.

source: Embassy
cs: Velvyslanectví

source: In Embassy, you can maintain your relationships with other states.
cs: Ve velvyslanectví můžeš řídit své vztahy s ostatními státy.

source: Basic Farm
cs: Základní farma

source: Farms produce the necessary food for your subjects. This basic version is able to produce 3 food per turn.
cs: Farmy produkují nezbytné jídlo pro tvé poddané. Tato základní verze dokáže vyprodukovat 3 jídla za kolo.

source: Advanced Farm
cs: Vylepšená farma

source: Farms produce the necessary food for your subjects. This advanced version is able to produce 5 food per turn.
cs: Farmy produkují nezbytné jídlo pro tvé poddané. Tato vylepšená verze dokáže vyprodukovat 5 jídla za kolo.

source: Fortress
cs: Pevnost

source: Fortresses provide food and healing for stationed units. This version can accommodate 4 units.
cs: Pevnosti poskytují jídlo a léčení pro umístěné jednotky. Tato verze může pojmout 4 jednotky.

source: Stronghold
cs: Bašta

source: Strongholds provide food and healing for stationed units. This version can accommodate 8 units.
cs: Bašty poskytují jídlo a léčení pro umístěné jednotky. Tato verze může pojmout 8 jednotek.

source: Basic Gold Mine
cs: Základní zlatý důl

source: Miners in this mine extract 1 gold per turn.
cs: Horníci v tomto dole vytěží 1 zlato za kolo.

source: Advanced Gold Mine
cs: Vylepšený zlatý důl

source: Miners in this mine extract 2 gold per turn.
cs: Horníci v tomto dole vytěží 2 zlata za kolo.

source: Hall of Heroes
cs: Síň hrdinů

source: Hall of Heroes allows you to summon heroes. They are stronger than usual units and do not require upkeep. However you can have only 1 hero of each type at the same time. With this version of the Hall, you can summon heroes level 2.
cs: Síň hrdinů ti umožňuje povolat hrdiny. Ti jsou silnější než normální jednotky a nevyžadují žold. Avšak můžeš mít jen jednoho hrdinu každého typu ve stejnou chvíli. S touto verzí Síně můžeš povolat hrdiny na úrovní 2.

source: Hall of Heroes allows you to summon heroes. They are stronger than usual units and do not require upkeep. However you can have only 1 hero of each type at the same time. With this version of the Hall, you can summon heroes level 3.
cs: Síň hrdinů ti umožňuje povolat hrdiny. Ti jsou silnější než normální jednotky a nevyžadují žold. Avšak můžeš mít jen jednoho hrdinu každého typu ve stejnou chvíli. S touto verzí Síně můžeš povolat hrdiny na úrovní 3.

source: Market
cs: Tržiště

source: Market allows you to exchange resources and trade with other states. It also produces 5 gold per turn.
cs: Tržiště ti umožňuje vyměňovat zdroje a obchodovat s ostatními státy. Také produkuje 5 zlata za kolo.

source: Basic Ore Mine
cs: Základní rudný důl

source: Miners in this mine extract 1 ore per turn. It can be then used by the Blacksmith or sold on market.
cs: Horníci v tomto dole vytěží 1 rudu za kolo. Ta pak může být použita v kovárně nebo prodána na tržišti.

source: Advanced Ore Mine
cs: Vylepšený rudný důl

source: Miners in this mine extract 2 ore per turn. It can be then used by the Blacksmith or sold on market.
cs: Horníci v tomto dole vytěží 2 rudy za kolo. Ta pak může být použita v kovárně nebo prodána na tržišti.

source: School
cs: Škola

source: Scholars in school produce 2 research point per turn.
cs: Učenci ve škole vyprodukují 2 výzkumné body za kolo.

source: University
cs: Univerzita

source: Scholars in university produce 5 research point per turn.
cs: Učenci v univerzitě vyprodukují 5 výzkumných bodů za kolo.

source: Temple
cs: Chrám

source: Temples train healers and heal adjacent allied units at the start of our turn.
cs: Chrámy trénují léčitelé a lečí blízké spojence na začátku našeho tahu.

source: Tower
cs: Věž

source: Towers are used to observe a small surrounding area. Archers can also hide in them and shoot nearby enemies.
cs: Věže slouží k pozorování malé přilehlé oblasti. Lučistníci se v nich mohou skrýt a střílet na blízké nepřátele.

source: Manned Tower
cs: Věž s posádkou

source: Towers are used to observe a small surrounding area. Archers hidden in them will shoot nearby enemies.
cs: Věže slouží k pozorování malé přilehlé oblasti. Lučistníci v nich ukrytí střílí na blízké nepřátele.

source: archers
cs: lučištníci

source: Town Hall
cs: Radnice

source: Town Hall is the central building of a village or small town. It produces 2 gold per turn.
cs: Radnice je hladní budovou vesnice nebo malého města. Produkuje 2 zlata za kolo.

source: City Hall
cs: Radnice

source: City Hall is the central building of a city. It produces 4 gold per turn.
cs: Radnice je hlavní budovou města. Produkuje 4 zlata za kolo.

source: Tower House
cs: Hrad

source: Tower House serves as a residence for a nobleman. It produces 6 gold per turn.
cs: Hrad slouží jako sídlo šlechtice. Vyprodukuje 6 zlata za kolo.

source: Castle
cs: Zámek

source: Only a great ruler can build castles. It produces 10 gold per turn.
cs: Jen velký vládce může stavět hrady. Produkuje 10 zlata za kolo.

source: Basic Woodcutter's Hut
cs: Základní dřevařova chata

source: This Woodcutter produces 1 wood per turn. It can be used to construct/upgrade buildings or sold on market.
cs: Tento dřevař vyprodukuje 1 dřeva za kolo. To pak může být použito na stavbu/vylepšení budov nebo prodáno na tržišti.

source: Advanced Woodcutter's Hut
cs: Vylepšená dřevařova chata

source: This Woodcutter produces 2 wood per turn. It can be used to construct/upgrade buildings or sold on market.
cs: Tento dřevař vyprodukuje 2 dřeva za kolo. To pak může být použito na stavbu/vylepšení budov nebo prodáno na tržišti.

source: Dwarvish Alchemist
cs: Trpasličí alchymista

source: Dwarvish Blacksmith
cs: Trpasličí kovář

source: Dwarvish Master of Alchemy
cs: Trpasličí mistr alchymie

source: Dwarvish Miner
cs: Trpasličí horník

source: Dwarvish miners are the grunt workers of Dwarvish society. They take the precious ores out of the ground, but do not ever take part in the crafting of weapons or artifacts.
cs: Trpasličí horníci jsou nejnižší pracovníci Trpasličího společenství. Dokáží získat drahocennou rudu ze země, ale už nemají žádnou úlohu při výrobě zbraní nebo artefaktů.

source: pick
cs: krumpáč

source: Dwarvish Ormserker
cs: Trpasličí ormserker

source: Dwarvish Potion Smith
cs: Trpasličí míchač lektvarů

source: Elvish Civilian
cs: Elfí civilista

source: Since elves are not warlike by nature, most of their population is composed by civilians who learn, at very early age, basic usage of swords and bows. This enables them to defend themselves, or their homes, in times of need, forming a fairly skilled militia. However, if you are hurling civilians at your foes, you’re clearly out of superior forces.
cs: Vzhledem k tomu, že elfové nejsou přirozeně bojechtiví, většinu jejich populace tvoří cilivisté, kteří se v raném věku učí základnímu použití mečů a luků. Toto jim umožňuje bránit sebe nebo jejich domovy v případě nutnosti, kdy tvoří poměrně kvalifikované milice. Avšak pokud vrháš civilisty na své nepřátele, jistě už nemáš lepší jednotky.

source: female^Elvish Initiate
cs: Elfí novicka

source: Rogue Mage
cs: Potulný mág

source: Some mages are thrown out of the mage’s guild for attempting to practice forbidden arts. Now completely outside the law, these rogue mages do whatever necessary to support their study of black magic. Although not as skilled as mages with more formal training, their magic can be quite lethal, while their banditry has resulted in moderate skill with the short sword.
cs: Někteří mágové jsou vyloučeni z magických cechů kvůli pokusům provozovat zapomenutá umění. Když jsou nyní kompletně mimo zákon, tito mágové se snaží dělat vše nezbytné, aby podpořili své studium černé magie. I když nejsou tak zkušení jako mágové s klasičtějším výcvikem, jejich magie může být celkem smrtící, zatímco jejich banditství je zdokonalilo v dovednostech s krátkým mečem.

source: Shadow Lord
cs: Stínový lord

source: Few humans fathom the secrets of light and dark magic and retain their sanity. Those that can master that balance become Shadow Lords, fully existing neither in the world of light nor the world of darkness. No longer needing physical weapons, they are fearsome to both their enemies and those they lord over.
cs: Nemnoho lidí odhalí tajemství světlé i temné magie a udrží si zdravý rozum. Mistři této rovnováhy se stanou Stínovými Lordy, plně neexistujícími ve světě světla ani ve světě temnoty. Už nepotřebuji fyzické zbraně a nahánějí strach svým nepřátelům i těm, kterým vládnou.

source: astral blade
cs: astrální čepel

source: shadow bolt
cs: stínový blesk

source: shadow blast
cs: závan smrti

source: Shadow Mage
cs: Stínový mág

source: Years of violence and brutality to support the study of forbidden magical arts have turned the shadow mages into feared fighters. Now completely enthralled with power, they have been known to command small followings of henchmen. They are outmatched in direct magical combat with their magic-using peers, instead channeling their energies into devastating melee attacks. Despite their offensive power, the corruption in their souls has begun to adversely affect their health.
cs: Roky násilí a brutality kvůli podpoře svých studií zavržených magických umění proměnilo stínové mágy v obávané bojovníky. Plně fascinování mocí, kterou ovládli, vedou malé skupinky následovníků. Při přímé konfrontaci za použití kouzel s ostatními mágy jsou v nevýhodě, proto spíše používají ničivé magické efekty pro posílení fyzických úderů. Navzdory jejich útočné moci, zkaženost v jejich duších zanechala patřičné následky na jejich zdraví.

source: Shaman
cs: Šaman

source: Village Healer
cs: Vesnický léčitel

source: Orcish Shaman
cs: Skřetí šaman

source: Death Baron
cs: Baron smrti

source: race^Building
cs: Budova

source: race^Buldings
cs: Budovy

source: Headquarters mode
cs: Mód velitelství

source: When enabled, a side is considered defeated also when its headquarters are destroyed
cs: Když je povoleno, strana se pokládá za poraženou také když je její velitelství zničino

source: First player to reach X score wins
cs: První hráč, který dosáhne X skóre, vyhrává

source: Needed score
cs: Potřebné skóre

source: Era of Empires
cs: Věk říší

source: The Cult
cs: Kult

source: The Gang
cs: Gang
